content/posts/windows-server-creating-and-viewing-a-storport-trace/index.org
---
date: 2023-07-22 16:24:55-07:00
draft: false
title: Windows Server Creating and Viewing a Storport Trace
---

* Creating a StorPort trace using logman.exe
LOGMAN.EXE is CLI utility for creating data collector sets.
A data collector set can be thought of as a container for choosing which performance counters or trace events to log.
All the logged data from the data collector will be stored in a single file.

A performance counter provides high-level, numeric, metrics for system behavior.
There are performance counters for CPU utilization, search indexing, disk utilization, processes, etc.
It provides general information on how parts of your computer are behaving.

Traces events are low-level events that get reported when something /note worthy/ happens with a system component or application.
The Windows kernel may report each time a DLL is loaded, unloaded, a process starts/stops, etc.
In this case, the StorPort driver trace reports things like latency, byte length, IO return codes, etc.

Everything we're doing here can be done through the PERFMON.EXE GUI

#+begin_src shell
# Creating the TraceLog
LOGMAN.EXE create trace "storport" -ow -o c:\PerfLogs\storport.etl -p "Microsoft-Windows-StorPort" 0xffffffffffffffff 0xff -nb 16 16 -bs 1024 -mode Circular -f bincirc -max 512 -ets

# Starting the trace log
LOGMAN.EXE start storport -ets

# When you feel like you captured the issue in the log, stop it.
LOGMAN.EXE stop storport -ets
#+end_src

*-ow* Overwrite an existing logfile

*-o* Path for the existing log

*-p* TODO

*HexCodes* TODO

*-nb* Number of event trace buffers

*-bs* Event trace buffer size

*-mode Circular* The event trace logger mode. Circular means the log file overwrites the oldest data constantly.

*-f bincirc* Log format. We're using the circular binary format

*-max 512* The max size in megabytes.

*-ets* Send commands to Event Trace Sessions directly without saving or scheduling.

* Viewing the trace data (Event Viewer Method)
We used LOGMAN to create a trace log and store the output to C:/PerfLogs/storport.etl.
Here's how you can open the file with Eventviewer

- Open EventViewer
- Click Action>OpenSavedLog
- Navigate to your storport.etc file, open it, and click the option to copy the data to an event log.
- Click on any log and select the "Details" tab

The event property you're looking for is "RequestDuration_100ns".
This is the TODOTODOTODO.
The measurement is done in nano-seconds.
To convert it to milliseconds, divide the value by 10,000

#+begin_src shell
# 22860ns is equal to 22ms
+ System 
- EventData 
  RequestDuration_100ns 22860 
  Irp 0xffffe10c1e9f7a20 
  Command 53 
  SrbStatus 1 
  OriginalIrp 0x0 
  Port 0 
  Bus 0 
  Target 0 
  LUN 0 
  ScsiStatus 0 
  ByteLengthOfTransfer 0 
  BuildIoDuration_100ns 21 
  StartIoDuration_100ns 121 
#+end_src

Less than 9ms = Excellent performance

Less than 15ms = Good Performance

Less than 25ms = Normal 

More than 25ms = Poor Performance

* Viewing the trace data (StorportPACMAN.ps1 Method)
