public/inbox/windows-server-creating-and-viewing-a-storport-trace/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Windows Server Creating and Viewing a Storport Trace</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Windows Server Creating and Viewing a Storport Trace</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Creating a StorPort trace using logman.exe</a>
</li>
<li><a href="#headline-2">Viewing the trace data (Event Viewer Method)</a>
</li>
<li><a href="#headline-3">Viewing the trace data (StorportPACMAN.ps1 Method)</a>
<ul>
<li><a href="#headline-4">Downloading the script</a>
</li>
</ul>
</li>
<li><a href="#headline-5">Preparing our storport.etl file</a>
</li>
<li><a href="#headline-6">Running the script</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Creating a StorPort trace using logman.exe
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>LOGMAN.EXE is CLI utility for creating data collector sets.
A data collector set can be thought of as a container for choosing which performance counters or trace events to log.
All the logged data from the data collector will be stored in a single file.</p>
<p>
A performance counter provides high-level, numeric, metrics for system behavior.
There are performance counters for CPU utilization, search indexing, disk utilization, processes, etc.
It provides general information on how parts of your computer are behaving.</p>
<p>
Traces events are low-level events that get reported when something <em>note worthy</em> happens with a system component or application.
The Windows kernel may report each time a DLL is loaded, unloaded, a process starts/stops, etc.
In this case, the StorPort driver trace reports things like latency, byte length, IO return codes, etc.</p>
<p>
Everything we&#39;re doing here can be done through the PERFMON.EXE GUI</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span><span style="color:#75715e"># Creating the TraceLog</span>
</span></span><span style="display:flex;"><span>LOGMAN.EXE create trace <span style="color:#e6db74">&#34;storport&#34;</span> -ow -o c:<span style="color:#ae81ff">\P</span>erfLogs<span style="color:#ae81ff">\s</span>torport.etl -p <span style="color:#e6db74">&#34;Microsoft-Windows-StorPort&#34;</span> 0xffffffffffffffff 0xff -nb <span style="color:#ae81ff">16</span> <span style="color:#ae81ff">16</span> -bs <span style="color:#ae81ff">1024</span> -mode Circular -f bincirc -max <span style="color:#ae81ff">512</span> -ets
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Starting the trace log</span>
</span></span><span style="display:flex;"><span>LOGMAN.EXE start storport -ets
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># When you feel like you captured the issue in the log, stop it.</span>
</span></span><span style="display:flex;"><span>LOGMAN.EXE stop storport -ets</span></span></code></pre></div>
</div>
<p>
<strong>-ow</strong> Overwrite an existing logfile</p>
<p>
<strong>-o</strong> Path for the existing log</p>
<p>
<strong>-p</strong> TODO</p>
<p>
<strong>HexCodes</strong> TODO</p>
<p>
<strong>-nb</strong> Number of event trace buffers</p>
<p>
<strong>-bs</strong> Event trace buffer size</p>
<p>
<strong>-mode Circular</strong> The event trace logger mode. Circular means the log file overwrites the oldest data constantly.</p>
<p>
<strong>-f bincirc</strong> Log format. We&#39;re using the circular binary format</p>
<p>
<strong>-max 512</strong> The max size in megabytes.</p>
<p>
<strong>-ets</strong> Send commands to Event Trace Sessions directly without saving or scheduling.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Viewing the trace data (Event Viewer Method)
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>We used LOGMAN to create a trace log and store the output to C:/PerfLogs/storport.etl.
Here&#39;s how you can open the file with Eventviewer</p>
<ul>
<li>Open EventViewer</li>
<li>Click Action&gt;OpenSavedLog</li>
<li>Navigate to your storport.etc file, open it, and click the option to copy the data to an event log.</li>
<li>Click on any log and select the &#34;Details&#34; tab</li>
</ul>
<p>The event property you&#39;re looking for is &#34;RequestDuration_100ns&#34;.
This is the TODOTODOTODO.
The measurement is done in nano-seconds.
To convert it to milliseconds, divide the value by 10,000</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span><span style="color:#75715e"># 22860ns is equal to 22ms</span>
</span></span><span style="display:flex;"><span>+ System 
</span></span><span style="display:flex;"><span>- EventData 
</span></span><span style="display:flex;"><span>  RequestDuration_100ns <span style="color:#ae81ff">22860</span> 
</span></span><span style="display:flex;"><span>  Irp 0xffffe10c1e9f7a20 
</span></span><span style="display:flex;"><span>  Command <span style="color:#ae81ff">53</span> 
</span></span><span style="display:flex;"><span>  SrbStatus <span style="color:#ae81ff">1</span> 
</span></span><span style="display:flex;"><span>  OriginalIrp 0x0 
</span></span><span style="display:flex;"><span>  Port <span style="color:#ae81ff">0</span> 
</span></span><span style="display:flex;"><span>  Bus <span style="color:#ae81ff">0</span> 
</span></span><span style="display:flex;"><span>  Target <span style="color:#ae81ff">0</span> 
</span></span><span style="display:flex;"><span>  LUN <span style="color:#ae81ff">0</span> 
</span></span><span style="display:flex;"><span>  ScsiStatus <span style="color:#ae81ff">0</span> 
</span></span><span style="display:flex;"><span>  ByteLengthOfTransfer <span style="color:#ae81ff">0</span> 
</span></span><span style="display:flex;"><span>  BuildIoDuration_100ns <span style="color:#ae81ff">21</span> 
</span></span><span style="display:flex;"><span>  StartIoDuration_100ns <span style="color:#ae81ff">121</span></span></span></code></pre></div>
</div>
<p>
Less than 9ms = Excellent performance</p>
<p>
Less than 15ms = Good Performance</p>
<p>
Less than 25ms = Normal </p>
<p>
More than 25ms = Poor Performance</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Viewing the trace data (StorportPACMAN.ps1 Method)
</h2>
