public/inbox/windows-server-creating-and-viewing-a-storport-trace/index.html
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Downloading the script
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>StorportPacman.PS1 is a powershell script written by Paul Reynolds at Microsoft.
It parses the STORPORT.ETL file into an organized, human readable, CSV file.</p>
<p>
For archival purposes, I&#39;m including a full copy and paste of it here.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span><span style="color:#75715e">#StorportPACMAN ported to Windows Powershell</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#Paul Reynolds PaulRey@microsoft.com -&gt; Improvements: Robin Hermann (RHE)</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.1 updated for 2012 R2</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.2 updated with performance enhancments</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.3 updated to make filter for storport data more robust</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.4 updated to make filter for storport data able to use storport ets trace data (insightweb)</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.5 updated to include addition strings to flag storport data</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.6 updated to fix bug in parameter errors</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.7 updated to fix Excel 2016 ACE provider bug that converts hex to decimal on the fly</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.8 updated to allow flexibility in installation directory </span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 1.9 updated to clean up leading and trailing spaces in header information and data, which caused problems in an Office 2016 update regression issue</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 2.0 updated to show warnings if data has any records with SCSI Status not 0 and/or SRB Status not 1</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 3.0 RHE: updated to a function for more agility</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">#version 3.1 RHE: add more parameters and fix the with $MyInvocation, $MyInvocation is an automatic variable populated at script run time, then if you execute $MyInvocation.MyCommand.Path in a powershell console or ISE isn&#39;t populated</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span><span style="color:#75715e">#You must run the script not the script content only!</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>Function Convert-ETWTraceToReadableFileCSV <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>    <span style="color:#f92672">[</span>CmdletBinding<span style="color:#f92672">()]</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>    <span style="color:#75715e">#read in parameters for requestdurationvalue and ETL location</span>
</span></span><span style="display:flex;"><span>    Param<span style="color:#f92672">(</span>
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">[</span>Parameter<span style="color:#f92672">(</span>Position<span style="color:#f92672">=</span>0,mandatory<span style="color:#f92672">=</span>$false,HelpMessage<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Path to the Skript and the Excel PowerPivot Templates (storport2012.xlsx)&#34;</span><span style="color:#f92672">)][</span>string<span style="color:#f92672">]</span>$WorkFolderPath <span style="color:#f92672">=</span> <span style="color:#e6db74">&#34;C:\StorPortPACMAN&#34;</span>,
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">[</span>Parameter<span style="color:#f92672">(</span>Position<span style="color:#f92672">=</span>1,mandatory<span style="color:#f92672">=</span>$false<span style="color:#f92672">)][</span>string<span style="color:#f92672">]</span>$Filter,
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">[</span>Parameter<span style="color:#f92672">(</span>Position<span style="color:#f92672">=</span>2,mandatory<span style="color:#f92672">=</span>$false<span style="color:#f92672">)][</span>string<span style="color:#f92672">]</span>$ETL,
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">[</span>Parameter<span style="color:#f92672">(</span>Position<span style="color:#f92672">=</span>3,mandatory<span style="color:#f92672">=</span>$false,HelpMessage<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;If you already converted the ETL to CSV&#34;</span><span style="color:#f92672">)][</span>string<span style="color:#f92672">]</span>$RAWXPerfCSVPath <span style="color:#f92672">=</span> $WorkFolderPath + <span style="color:#e6db74">&#39;\raw-xperf.csv&#39;</span>
</span></span><span style="display:flex;"><span>    <span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>    process <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>        <span style="color:#75715e">#edit this string for future change to storport data headers </span>
</span></span><span style="display:flex;"><span>        $strStorportData <span style="color:#f92672">=</span> @<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;Microsoft-Windows-StorPort/Miniport&#39;</span>,<span style="color:#e6db74">&#39;Microsoft-Windows-StorPort/Port /Info&#39;</span>,<span style="color:#e6db74">&#39;Microsoft-Windows-StorPort/Port/win:Info&#39;</span>,<span style="color:#e6db74">&#39;Microsoft-Windows-StorPort/TaskMiniportIORequestServiceTime&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">[</span>System.Reflection.Assembly<span style="color:#f92672">]</span>::LoadWithPartialName<span style="color:#f92672">(</span><span style="color:#e6db74">&#34;System.Windows.Forms&#34;</span><span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>        $storportpacmandirectory <span style="color:#f92672">=</span> $WorkFolderPath <span style="color:#75715e">#Split-Path -Parent $MyInvocation.MyCommand.Path #&#34;C:\StorPortPACMAN&#34; </span>
</span></span><span style="display:flex;"><span>        $requestduration_multiplier <span style="color:#f92672">=</span> <span style="color:#ae81ff">1</span> <span style="color:#75715e">#this will change to 10,000 if the OS is Server 2012 due to differences in requestduration units (milliseconds in 2008, 100ns in 2012)</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>        <span style="color:#75715e">#test if requestdurationvalue is present and a valid integer</span>
</span></span><span style="display:flex;"><span>        If <span style="color:#f92672">(</span>$filter -eq <span style="color:#e6db74">&#39;&#39;</span><span style="color:#f92672">){</span>
</span></span><span style="display:flex;"><span>            $requestdurationvalue <span style="color:#f92672">=</span> <span style="color:#ae81ff">1000000</span> <span style="color:#75715e">#default to 1000000 if not present(do NOT use commas)</span>
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>            If<span style="color:#f92672">((</span>$filter -as <span style="color:#f92672">[</span>Int64<span style="color:#f92672">])</span> -eq $null<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;The request duration filter is either not a valid integer or has commas.&#39;</span><span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>                exit
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                $requestdurationvalue <span style="color:#f92672">=</span> <span style="color:#f92672">[</span>Int64<span style="color:#f92672">]</span>$filter
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>        If <span style="color:#f92672">(</span>$RAWPerfCSVPath -eq <span style="color:#e6db74">&#39;&#39;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>            <span style="color:#75715e">#test if etl file is present and a valid file</span>
</span></span><span style="display:flex;"><span>            If<span style="color:#f92672">(</span>$etl -eq <span style="color:#e6db74">&#39;&#39;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                $ETLlocation <span style="color:#f92672">=</span> $storportpacmandirectory + <span style="color:#e6db74">&#39;\storport.etl&#39;</span>
</span></span><span style="display:flex;"><span>                If <span style="color:#f92672">(</span>-not <span style="color:#f92672">(</span>Test-Path $ETLlocation -PathType leaf<span style="color:#f92672">))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;Sorry, but the file &#34;Storport.etl&#34; was not found.  Is it named correctly and in the storportpacman directory?&#39;</span><span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>                    exit
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                If <span style="color:#f92672">(</span>-not <span style="color:#f92672">(</span>Test-Path $etl -PathType leaf<span style="color:#f92672">))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                  <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;Sorry, but the file &#34;&#39;</span> + $etl + <span style="color:#e6db74">&#39;&#34; was not found.&#39;</span><span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>                  exit
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                  $ETLlocation <span style="color:#f92672">=</span> $etl
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>            Write-Progress -Activity <span style="color:#e6db74">&#34;StorportPACMAN Progress&#34;</span> -Status <span style="color:#e6db74">&#34;Converting ETL file to CSV file via XPERF&#34;</span> -PercentComplete <span style="color:#e6db74">&#34;33&#34;</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>            try <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                $myargs <span style="color:#f92672">=</span> <span style="color:#e6db74">&#34;-i &#34;</span> + <span style="color:#f92672">(</span><span style="color:#e6db74">&#39;&#34;{0}&#34;&#39;</span> -f $ETLlocation<span style="color:#f92672">)</span> + <span style="color:#e6db74">&#34; -o &#34;</span>  + <span style="color:#f92672">(</span><span style="color:#e6db74">&#39;&#34;{0}&#34;&#39;</span> -f $storportpacmandirectory<span style="color:#f92672">)</span> + <span style="color:#e6db74">&#34;\raw-xperf.csv -tle&#34;</span>
</span></span><span style="display:flex;"><span>                Start-Process xperf -ArgumentList $myargs -Wait
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>            catch <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;There was an error running XPerf.  Is it installed and in your system path?  The error message is &#39;</span> + $_.Exception.Message<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>                exit
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>        try <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>            $reader <span style="color:#f92672">=</span> New-Object System.IO.StreamReader<span style="color:#f92672">(</span>$RAWXPerfCSVPath<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>            $writer <span style="color:#f92672">=</span> New-Object System.IO.StreamWriter<span style="color:#f92672">(</span>$storportpacmandirectory + <span style="color:#e6db74">&#39;\processed-xperf.csv&#39;</span><span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span> catch <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;There was an error creating the readers or writers.  Do you have write access to the &#39;</span> + $storportpacmandirectory?  + <span style="color:#e6db74">&#39; The error message is &#39;</span> + $_.Exception.Message<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>            exit
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>        try <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>            Write-Progress -Activity <span style="color:#e6db74">&#34;StorportPACMAN Progress&#34;</span> -Status <span style="color:#e6db74">&#34;Scrubbing Data&#34;</span> -PercentComplete <span style="color:#e6db74">&#34;50&#34;</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>            $already_wrote_header <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;false&#39;</span>;
</span></span><span style="display:flex;"><span>            $request_duration_index <span style="color:#f92672">=</span> 14;
</span></span><span style="display:flex;"><span>            $record_counter <span style="color:#f92672">=</span> 0;
</span></span><span style="display:flex;"><span>            $scsi_status_not_0_counter<span style="color:#f92672">=</span>0;
</span></span><span style="display:flex;"><span>            $srb_status_not_1_counter<span style="color:#f92672">=</span>0;
</span></span><span style="display:flex;"><span>            $scsi_status_index <span style="color:#f92672">=</span> 16;
</span></span><span style="display:flex;"><span>            $srb_status_index <span style="color:#f92672">=</span> 17;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>            While <span style="color:#f92672">(</span>$reader.Peek<span style="color:#f92672">()</span> -gt -1<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                $original_record <span style="color:#f92672">=</span> $reader.ReadLine<span style="color:#f92672">()</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$original_record.Contains<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;OS Version:&#39;</span><span style="color:#f92672">))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#75715e">#check if O/S is windows 2012 or greater and if it is, make requestduration multiplier 10000 since requestdurations changed from millisecond to 100 nanosecond increments</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#75715e">#also request_duration column changes from 14 to 9</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                    <span style="color:#66d9ef">if</span> <span style="color:#f92672">([</span>Double<span style="color:#f92672">]</span>$original_record.Substring<span style="color:#f92672">(</span>11,4<span style="color:#f92672">)</span> -ge 6.2<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                        $requestduration_multiplier <span style="color:#f92672">=</span> 10000;
</span></span><span style="display:flex;"><span>                        $request_duration_index <span style="color:#f92672">=</span> 9;
</span></span><span style="display:flex;"><span>                        $srb_status_index <span style="color:#f92672">=</span> 12;
</span></span><span style="display:flex;"><span>                        $scsi_status_index <span style="color:#f92672">=</span> 18;
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                    <span style="color:#75715e">#get the trace start date time</span>
</span></span><span style="display:flex;"><span>                    $str_start_time <span style="color:#f92672">=</span> $original_record.Substring<span style="color:#f92672">(</span>$original_record.IndexOf<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;Trace Start:&#39;</span><span style="color:#f92672">)</span> + <span style="color:#f92672">(</span><span style="color:#e6db74">&#39;trace start:&#39;</span><span style="color:#f92672">)</span>.Length, $original_record.IndexOf<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;,&#39;</span>, $original_record.IndexOf<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;Trace Start:&#39;</span><span style="color:#f92672">))</span> - <span style="color:#f92672">(</span>$original_record.IndexOf<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;Trace Start:&#39;</span><span style="color:#f92672">)</span> + <span style="color:#f92672">(</span><span style="color:#e6db74">&#39;trace start:&#39;</span><span style="color:#f92672">)</span>.Length<span style="color:#f92672">))</span>;
</span></span><span style="display:flex;"><span>                    $int_start_time <span style="color:#f92672">=</span> <span style="color:#f92672">[</span>Int64<span style="color:#f92672">](</span>$str_start_time<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                    $start_time <span style="color:#f92672">=</span> Get-Date<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;1/1/1601 12:00AM GMT&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                    $start_time <span style="color:#f92672">=</span> $start_time.AddTicks<span style="color:#f92672">(</span>$int_start_time<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                    <span style="color:#66d9ef">continue</span>
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                <span style="color:#75715e">#read in raw data and scrub it</span>
</span></span><span style="display:flex;"><span>                $isStorportData <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;false&#39;</span>;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                foreach <span style="color:#f92672">(</span>$s in $strStorportData<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$original_record.Contains<span style="color:#f92672">(</span>$s<span style="color:#f92672">))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                        $isStorportData <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;true&#39;</span>;
</span></span><span style="display:flex;"><span>                        break;
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$isStorportData -eq <span style="color:#e6db74">&#39;true&#39;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span> <span style="color:#75715e">#this ignores all data except for lines with a string match in $strStorportData</span>
</span></span><span style="display:flex;"><span>                    $storport_data <span style="color:#f92672">=</span> $original_record.Split<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;,&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                    If<span style="color:#f92672">((</span>$storport_data<span style="color:#f92672">[</span>1<span style="color:#f92672">]</span> -as <span style="color:#f92672">[</span>Int64<span style="color:#f92672">])</span> -ne $null<span style="color:#f92672">)</span> <span style="color:#f92672">{</span> <span style="color:#75715e">#test for header versus data </span>
</span></span><span style="display:flex;"><span>                        $record_counter <span style="color:#f92672">=</span> $record_counter + 1;
</span></span><span style="display:flex;"><span>                        $dbl_delta_time <span style="color:#f92672">=</span> $storport_data<span style="color:#f92672">[</span>1<span style="color:#f92672">]</span> / 1000;
</span></span><span style="display:flex;"><span>                        $storport_data<span style="color:#f92672">[</span>1<span style="color:#f92672">]</span> <span style="color:#f92672">=</span> $start_time.AddMilliseconds<span style="color:#f92672">(</span>$dbl_delta_time<span style="color:#f92672">)</span>.ToLocalTime<span style="color:#f92672">()</span>.ToString<span style="color:#f92672">()</span>;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                        <span style="color:#75715e">#fix for Excel 2016 bug that converts hex to decimal on the fly</span>
</span></span><span style="display:flex;"><span>                        <span style="color:#66d9ef">if</span><span style="color:#f92672">(</span>$request_duration_index -eq 9<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                            $storport_data<span style="color:#f92672">[</span>11<span style="color:#f92672">]</span> <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;&#34;&#39;</span> + $storport_data<span style="color:#f92672">[</span>11<span style="color:#f92672">]</span> + <span style="color:#e6db74">&#39;&#34;&#39;</span>;
</span></span><span style="display:flex;"><span>                            $storport_data<span style="color:#f92672">[</span>12<span style="color:#f92672">]</span> <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;&#34;&#39;</span> + $storport_data<span style="color:#f92672">[</span>12<span style="color:#f92672">]</span> + <span style="color:#e6db74">&#39;&#34;&#39;</span>;
</span></span><span style="display:flex;"><span>                            $storport_data<span style="color:#f92672">[</span>18<span style="color:#f92672">]</span> <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;&#34;&#39;</span> + $storport_data<span style="color:#f92672">[</span>18<span style="color:#f92672">]</span> + <span style="color:#e6db74">&#39;&#34;&#39;</span>;
</span></span><span style="display:flex;"><span>                        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                        $header_flag <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;false&#39;</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                        $header_flag <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;true&#39;</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                    $original_record <span style="color:#f92672">=</span> $storport_data<span style="color:#f92672">[</span>1<span style="color:#f92672">]</span>.Trim<span style="color:#f92672">()</span> + <span style="color:#e6db74">&#39;,&#39;</span>;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                    <span style="color:#66d9ef">for</span> <span style="color:#f92672">(</span>$i <span style="color:#f92672">=</span> 9; $i -lt $storport_data.Length; $i++<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                        $original_record +<span style="color:#f92672">=</span> $storport_data<span style="color:#f92672">[</span>$i<span style="color:#f92672">]</span>.Trim<span style="color:#f92672">()</span> + <span style="color:#e6db74">&#39;,&#39;</span>;
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                    <span style="color:#75715e">#fix for 2012 changing record names</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$header_flag<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                        $original_record <span style="color:#f92672">=</span> $original_record.Replace<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;RequestDuration_100ns&#39;</span>, <span style="color:#e6db74">&#39;RequestDuration in 100ns&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                        $original_record <span style="color:#f92672">=</span> $original_record.Replace<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;BuildIoDuration_100ns&#39;</span>, <span style="color:#e6db74">&#39;BuildIoDuration in 100ns&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                        $original_record <span style="color:#f92672">=</span> $original_record.Replace<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;StartIoDuration_100ns&#39;</span>, <span style="color:#e6db74">&#39;StartIoDuration in 100ns&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                        $original_record <span style="color:#f92672">=</span> $original_record.Replace<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;ByteLengthOfTransfer&#39;</span>, <span style="color:#e6db74">&#39;DataTransferLength&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                    <span style="color:#75715e">#cleanup</span>
</span></span><span style="display:flex;"><span>                    $original_record <span style="color:#f92672">=</span> $original_record.Replace<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;TimeStamp&#39;</span>,<span style="color:#e6db74">&#39;DateTime&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                    $original_record <span style="color:#f92672">=</span> $original_record.TrimEnd<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;,&#39;</span><span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                    $original_record <span style="color:#f92672">=</span> $original_record.Replace<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;(&#39;</span>,$null<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                    $original_record <span style="color:#f92672">=</span> $original_record.Replace<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;)&#39;</span>,$null<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                    $original_record <span style="color:#f92672">=</span> $original_record.Replace<span style="color:#f92672">(</span><span style="color:#e6db74">&#34;\&#39;&#34;</span>,$null<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                    <span style="color:#66d9ef">if</span> <span style="color:#f92672">((</span>$requestdurationvalue -ne -1<span style="color:#f92672">)</span> -AND <span style="color:#f92672">(</span>$header_flag -eq <span style="color:#e6db74">&#39;false&#39;</span><span style="color:#f92672">))</span> <span style="color:#f92672">{</span>  <span style="color:#75715e">#write out the data immediately if it is the header or there is no filter (-1 value for $requestdurationvalue)</span>
</span></span><span style="display:flex;"><span>                        <span style="color:#66d9ef">if</span> <span style="color:#f92672">([</span>Int64<span style="color:#f92672">](</span>$storport_data<span style="color:#f92672">[</span>$request_duration_index<span style="color:#f92672">]</span>.Trim<span style="color:#f92672">())</span> -lt <span style="color:#f92672">(</span>$requestdurationvalue * $requestduration_multiplier<span style="color:#f92672">))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                            <span style="color:#75715e">#write the line if the value of requestduration is lower then the filter</span>
</span></span><span style="display:flex;"><span>                            $writer.WriteLine<span style="color:#f92672">(</span>$original_record<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                            <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$request_duration_index -eq 9<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#75715e">#scsi status check</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>-Not <span style="color:#f92672">(</span>$storport_data<span style="color:#f92672">[</span>$scsi_status_index<span style="color:#f92672">]</span>.Contains<span style="color:#f92672">(</span><span style="color:#e6db74">&#34;0x00&#34;</span><span style="color:#f92672">)))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                    $scsi_status_not_0_counter <span style="color:#f92672">=</span> $scsi_status_not_0_counter + 1;
</span></span><span style="display:flex;"><span>                                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                                <span style="color:#75715e">#srb status check</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>-Not <span style="color:#f92672">(</span>$storport_data<span style="color:#f92672">[</span>$srb_status_index<span style="color:#f92672">]</span>.Contains<span style="color:#f92672">(</span><span style="color:#e6db74">&#34;0x01&#34;</span><span style="color:#f92672">)))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                    $srb_status_not_1_counter <span style="color:#f92672">=</span> $srb_status_not_1_counter + 1;
</span></span><span style="display:flex;"><span>                                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                            <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                                <span style="color:#75715e">#scsi status check</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$storport_data<span style="color:#f92672">[</span>$scsi_status_index<span style="color:#f92672">]</span>.Trim<span style="color:#f92672">()</span> -ne <span style="color:#e6db74">&#34;0&#34;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                    $scsi_status_not_0_counter <span style="color:#f92672">=</span> $scsi_status_not_0_counter + 1;
</span></span><span style="display:flex;"><span>                                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                                <span style="color:#75715e">#srb status check</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$storport_data<span style="color:#f92672">[</span>$srb_status_index<span style="color:#f92672">]</span>.Trim<span style="color:#f92672">()</span> -ne <span style="color:#e6db74">&#34;1&#34;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                    $srb_status_not_1_counter <span style="color:#f92672">=</span> $srb_status_not_1_counter + 1;
</span></span><span style="display:flex;"><span>                                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                        <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$header_flag -eq <span style="color:#e6db74">&#39;true&#39;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                            <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$already_wrote_header -eq <span style="color:#e6db74">&#39;false&#39;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                $writer.WriteLine<span style="color:#f92672">(</span>$original_record<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>                            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                            $already_wrote_header <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;true&#39;</span>;
</span></span><span style="display:flex;"><span>                        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                        <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                            $writer.WriteLine<span style="color:#f92672">(</span>$original_record<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                            <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$request_duration_index -eq 9<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#75715e">#scsi status check</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>-Not <span style="color:#f92672">(</span>$storport_data<span style="color:#f92672">[</span>$scsi_status_index<span style="color:#f92672">]</span>.Contains<span style="color:#f92672">(</span><span style="color:#e6db74">&#34;0x00&#34;</span><span style="color:#f92672">)))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                    $scsi_status_not_0_counter +<span style="color:#f92672">=</span> 1;
</span></span><span style="display:flex;"><span>                                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                                <span style="color:#75715e">#srb status check</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>-Not <span style="color:#f92672">(</span>$storport_data<span style="color:#f92672">[</span>$srb_status_index<span style="color:#f92672">]</span>.Contains<span style="color:#f92672">(</span><span style="color:#e6db74">&#34;0x01&#34;</span><span style="color:#f92672">)))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                    $srb_status_not_1_counter +<span style="color:#f92672">=</span> 1;
</span></span><span style="display:flex;"><span>                                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                            <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#75715e">#scsi status check                       </span>
</span></span><span style="display:flex;"><span>                                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$storport_data<span style="color:#f92672">[</span>$scsi_status_index<span style="color:#f92672">]</span>.Trim<span style="color:#f92672">()</span> -ne <span style="color:#e6db74">&#34;0&#34;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                    $scsi_status_not_0_counter +<span style="color:#f92672">=</span> 1;
</span></span><span style="display:flex;"><span>                                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                                <span style="color:#75715e">#srb status check</span>
</span></span><span style="display:flex;"><span>                                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$storport_data<span style="color:#f92672">[</span>$srb_status_index<span style="color:#f92672">]</span>.Trim<span style="color:#f92672">()</span> -ne <span style="color:#e6db74">&#34;1&#34;</span><span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                                    $srb_status_not_1_counter +<span style="color:#f92672">=</span> 1;
</span></span><span style="display:flex;"><span>                                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                    <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>            $writer.Flush<span style="color:#f92672">()</span>
</span></span><span style="display:flex;"><span>            $writer.Close<span style="color:#f92672">()</span>
</span></span><span style="display:flex;"><span>            $reader.Close<span style="color:#f92672">()</span>
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>        catch <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;There was an error while scrubbing the data. The error message is &#39;</span> + $_.Exception.Message<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>            exit
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>        <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$record_counter -ne 0<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>            <span style="color:#75715e"># open exel spreadsheet</span>
</span></span><span style="display:flex;"><span>            Write-Progress -Activity <span style="color:#e6db74">&#34;StorportPACMAN Progress&#34;</span> -Status <span style="color:#e6db74">&#34;Opening Excel Spreadsheet&#34;</span> -PercentComplete <span style="color:#e6db74">&#34;66&#34;</span> 
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>            <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$requestduration_multiplier -eq 10000<span style="color:#f92672">)</span> <span style="color:#f92672">{</span> <span style="color:#75715e">#Check for Windows 2012</span>
</span></span><span style="display:flex;"><span>                $workbookpath <span style="color:#f92672">=</span> $storportpacmandirectory + <span style="color:#e6db74">&#39;\storport2012.xlsx&#39;</span>
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                $workbookpath <span style="color:#f92672">=</span> $storportpacmandirectory + <span style="color:#e6db74">&#39;\storport2008.xlsx&#39;</span>
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>            Try <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                $excel <span style="color:#f92672">=</span> New-Object -ComObject Excel.Application
</span></span><span style="display:flex;"><span>                $excel.visible <span style="color:#f92672">=</span> $true
</span></span><span style="display:flex;"><span>                $workbook <span style="color:#f92672">=</span> $excel.workbooks.open<span style="color:#f92672">(</span>$workbookpath<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>                $workbook.refreshall<span style="color:#f92672">()</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                $mymessage <span style="color:#f92672">=</span> <span style="color:#e6db74">&#34;Data Refresh Complete. Processed &#34;</span> + $record_counter.ToString<span style="color:#f92672">()</span> + <span style="color:#e6db74">&#34; records.&#34;</span>;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$scsi_status_not_0_counter -ne 0<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                    $mymessage <span style="color:#f92672">=</span> $mymessage + <span style="color:#e6db74">&#34;`r`nWARNING: there were &#34;</span> + $scsi_status_not_0_counter.ToString<span style="color:#f92672">()</span> + <span style="color:#e6db74">&#34; records that have a SCSI Status other than GOOD - please review the data.&#34;</span>;
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>$srb_status_not_1_counter -ne 0<span style="color:#f92672">)</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                    $mymessage <span style="color:#f92672">=</span> $mymessage + <span style="color:#e6db74">&#34;`r`nWARNING: there were &#34;</span> + $srb_status_not_1_counter.ToString<span style="color:#f92672">()</span> + <span style="color:#e6db74">&#34; records that have a SRB Status of not completing successfully - please review the data.&#34;</span>;
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span>$mymessage<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span> catch <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;There was an error opening one of the spreadsheets. Make sure both storport2012.xlsx and storport2008.xlsx are in the &#39;</span> + $storportpacmandirectory + <span style="color:#e6db74">&#39; directory.  The error message is &#39;</span> + $_.Exception.Message<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>                exit
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>            <span style="color:#f92672">[</span>System.Windows.Forms.MessageBox<span style="color:#f92672">]</span>::Show<span style="color:#f92672">(</span><span style="color:#e6db74">&#39;There was no Storport data in the ETL file.  Please check how you ran the Storport trace.&#39;</span><span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>            exit
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>    <span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span><span style="color:#f92672">}</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
