content/posts/windows-server-creating-and-viewing-a-storport-trace/index.org
* Preparing our storport.etl file
We have to use XPerf.exe to convert the ETL file into a CSV before we sort it with StorportPacman.ps1.
Download the Windows Performance Toolkit from
[[https://docs.microsoft.com/en-us/windows-hardware/get-started/adk-install][this Windows ADK link]].

Once the toolkit is installed, convert the storport.etl file to a CSV

#+begin_src shell
xperf -i C:\Perflogs\storport.ETL -o C:\Perflogs\raw-xperf.csv -tle
#+end_src

Now finally download the PowerPivot Excel templates from [[http://wiki.webperfect.ch/index.php?title=Datei:Storport_Excel_PowerPivot-Templates.zip][wiki.webperfect.ch]]
or my [[https://archive.org/details/storport-excel-power-pivot-templates][upload to archive.org]]

* Running the script
Copy and paste the script into a ps1 file.
Next, import it using this command

#+begin_src shell
Import-Module -Name ./StorportPacman.ps1
#+end_src

Now lets run the script.
The name of your raw-xperf.csv file is important.
Unless changed, raw-xperf.csv is the default filename the script looks for
The filenames of the PowerPivot templates are sensitive too.

#+begin_src shell
# Remember to keep the xlsx and raw-xperf.csv files in the the same folder
Convert-ETWTraceToReadableFileCSV -WorkFolderPath C:\PerfLogs\
#+end_src
