public/inbox/windows-server-creating-and-viewing-a-storport-trace/index.html
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Preparing our storport.etl file
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>We have to use XPerf.exe to convert the ETL file into a CSV before we sort it with StorportPacman.ps1.
Download the Windows Performance Toolkit from
<a href="https://docs.microsoft.com/en-us/windows-hardware/get-started/adk-install">this Windows ADK link</a>.</p>
<p>
Once the toolkit is installed, convert the storport.etl file to a CSV</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>xperf -i C:<span style="color:#ae81ff">\P</span>erflogs<span style="color:#ae81ff">\s</span>torport.ETL -o C:<span style="color:#ae81ff">\P</span>erflogs<span style="color:#ae81ff">\r</span>aw-xperf.csv -tle</span></span></code></pre></div>
</div>
<p>
Now finally download the PowerPivot Excel templates from <a href="http://wiki.webperfect.ch/index.php?title=Datei:Storport_Excel_PowerPivot-Templates.zip">wiki.webperfect.ch</a>
or my <a href="https://archive.org/details/storport-excel-power-pivot-templates">upload to archive.org</a></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Running the script
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Copy and paste the script into a ps1 file.
Next, import it using this command</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>Import-Module -Name ./StorportPacman.ps1</span></span></code></pre></div>
</div>
<p>
Now lets run the script.
The name of your raw-xperf.csv file is important.
Unless changed, raw-xperf.csv is the default filename the script looks for
The filenames of the PowerPivot templates are sensitive too.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span><span style="color:#75715e"># Remember to keep the xlsx and raw-xperf.csv files in the the same folder</span>
</span></span><span style="display:flex;"><span>Convert-ETWTraceToReadableFileCSV -WorkFolderPath C:<span style="color:#ae81ff">\P</span>erfLogs<span style="color:#960050;background-color:#1e0010">\</span></span></span></code></pre></div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
